MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26J13/mcu.h
// Register: CCPR7L
#define CCPR7L CCPR7L
extern volatile unsigned char           CCPR7L              __at(0xF0A);
#ifndef _LIB_BUILD
asm("CCPR7L equ 0F0Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR7L                 :8;
    };
} CCPR7Lbits_t;
extern volatile CCPR7Lbits_t CCPR7Lbits __at(0xF0A);
// bitfield macros
#define _CCPR7L_CCPR7L_POSN                                 0x0
#define _CCPR7L_CCPR7L_POSITION                             0x0
#define _CCPR7L_CCPR7L_SIZE                                 0x8
#define _CCPR7L_CCPR7L_LENGTH                               0x8
#define _CCPR7L_CCPR7L_MASK                                 0xFF

// Register: CCPR7H
#define CCPR7H CCPR7H
extern volatile unsigned char           CCPR7H              __at(0xF0B);
#ifndef _LIB_BUILD
asm("CCPR7H equ 0F0Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR7H                 :8;
    };
} CCPR7Hbits_t;
extern volatile CCPR7Hbits_t CCPR7Hbits __at(0xF0B);
// bitfield macros
#define _CCPR7H_CCPR7H_POSN                                 0x0
#define _CCPR7H_CCPR7H_POSITION                             0x0
#define _CCPR7H_CCPR7H_SIZE                                 0x8
#define _CCPR7H_CCPR7H_LENGTH                               0x8
#define _CCPR7H_CCPR7H_MASK                                 0xFF

// Register: CCP6CON
#define CCP6CON CCP6CON
extern volatile unsigned char           CCP6CON             __at(0xF0C);
#ifndef _LIB_BUILD
asm("CCP6CON equ 0F0Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP6M                  :4;
        unsigned DC6B                   :2;
    };
    struct {
        unsigned CCP6M0                 :1;
        unsigned CCP6M1                 :1;
        unsigned CCP6M2                 :1;
        unsigned CCP6M3                 :1;
        unsigned DC6B0                  :1;
        unsigned DC6B1                  :1;
    };
} CCP6CONbits_t;
extern volatile CCP6CONbits_t CCP6CONbits __at(0xF0C);
// bitfield macros
#define _CCP6CON_CCP6M_POSN                                 0x0
#define _CCP6CON_CCP6M_POSITION                             0x0
#define _CCP6CON_CCP6M_SIZE                                 0x4
#define _CCP6CON_CCP6M_LENGTH                               0x4
#define _CCP6CON_CCP6M_MASK                                 0xF
#define _CCP6CON_DC6B_POSN                                  0x4
#define _CCP6CON_DC6B_POSITION                              0x4
#define _CCP6CON_DC6B_SIZE                                  0x2
#define _CCP6CON_DC6B_LENGTH                                0x2
#define _CCP6CON_DC6B_MASK                                  0x30
#define _CCP6CON_CCP6M0_POSN                                0x0
#define _CCP6CON_CCP6M0_POSITION                            0x0
#define _CCP6CON_CCP6M0_SIZE                                0x1
#define _CCP6CON_CCP6M0_LENGTH                              0x1
#define _CCP6CON_CCP6M0_MASK                                0x1
#define _CCP6CON_CCP6M1_POSN                                0x1
#define _CCP6CON_CCP6M1_POSITION                            0x1
#define _CCP6CON_CCP6M1_SIZE                                0x1
#define _CCP6CON_CCP6M1_LENGTH                              0x1
#define _CCP6CON_CCP6M1_MASK                                0x2
#define _CCP6CON_CCP6M2_POSN                                0x2
#define _CCP6CON_CCP6M2_POSITION                            0x2
#define _CCP6CON_CCP6M2_SIZE                                0x1
#define _CCP6CON_CCP6M2_LENGTH                              0x1
#define _CCP6CON_CCP6M2_MASK                                0x4
#define _CCP6CON_CCP6M3_POSN                                0x3
#define _CCP6CON_CCP6M3_POSITION                            0x3
#define _CCP6CON_CCP6M3_SIZE                                0x1
#define _CCP6CON_CCP6M3_LENGTH                              0x1
#define _CCP6CON_CCP6M3_MASK                                0x8
#define _CCP6CON_DC6B0_POSN                                 0x4
#define _CCP6CON_DC6B0_POSITION                             0x4
#define _CCP6CON_DC6B0_SIZE                                 0x1
#define _CCP6CON_DC6B0_LENGTH                               0x1
#define _CCP6CON_DC6B0_MASK                                 0x10
#define _CCP6CON_DC6B1_POSN                                 0x5
#define _CCP6CON_DC6B1_POSITION                             0x5
#define _CCP6CON_DC6B1_SIZE                                 0x1
#define _CCP6CON_DC6B1_LENGTH                               0x1
#define _CCP6CON_DC6B1_MASK                                 0x20

// Register: CCPR6L
#define CCPR6L CCPR6L
extern volatile unsigned char           CCPR6L              __at(0xF0D);
#ifndef _LIB_BUILD
asm("CCPR6L equ 0F0Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR6L                 :8;
    };
} CCPR6Lbits_t;
extern volatile CCPR6Lbits_t CCPR6Lbits __at(0xF0D);
// bitfield macros
#define _CCPR6L_CCPR6L_POSN                                 0x0
#define _CCPR6L_CCPR6L_POSITION                             0x0
#define _CCPR6L_CCPR6L_SIZE                                 0x8
#define _CCPR6L_CCPR6L_LENGTH                               0x8
#define _CCPR6L_CCPR6L_MASK                                 0xFF

// Register: CCPR6H
#define CCPR6H CCPR6H
extern volatile unsigned char           CCPR6H              __at(0xF0E);
#ifndef _LIB_BUILD
asm("CCPR6H equ 0F0Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR6H                 :8;
    };
} CCPR6Hbits_t;
extern volatile CCPR6Hbits_t CCPR6Hbits __at(0xF0E);
// bitfield macros
#define _CCPR6H_CCPR6H_POSN                                 0x0
#define _CCPR6H_CCPR6H_POSITION                             0x0
#define _CCPR6H_CCPR6H_SIZE                                 0x8
#define _CCPR6H_CCPR6H_LENGTH                               0x8
#define _CCPR6H_CCPR6H_MASK                                 0xFF

// Register: CCP5CON
#define CCP5CON CCP5CON
extern volatile unsigned char           CCP5CON             __at(0xF0F);
#ifndef _LIB_BUILD
asm("CCP5CON equ 0F0Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP5M                  :4;
        unsigned DC5B                   :2;
    };
    struct {
        unsigned CCP5M0                 :1;
        unsigned CCP5M1                 :1;
        unsigned CCP5M2                 :1;
        unsigned CCP5M3                 :1;
        unsigned DC5B0                  :1;
        unsigned DC5B1                  :1;
    };
} CCP5CONbits_t;
extern volatile CCP5CONbits_t CCP5CONbits __at(0xF0F);
// bitfield macros
#define _CCP5CON_CCP5M_POSN                                 0x0
#define _CCP5CON_CCP5M_POSITION                             0x0
#define _CCP5CON_CCP5M_SIZE                                 0x4
#define _CCP5CON_CCP5M_LENGTH                               0x4
#define _CCP5CON_CCP5M_MASK                                 0xF
#define _CCP5CON_DC5B_POSN                                  0x4
#define _CCP5CON_DC5B_POSITION                              0x4
#define _CCP5CON_DC5B_SIZE                                  0x2
#define _CCP5CON_DC5B_LENGTH                                0x2
#define _CCP5CON_DC5B_MASK                                  0x30
#define _CCP5CON_CCP5M0_POSN                                0x0
#define _CCP5CON_CCP5M0_POSITION                            0x0
#define _CCP5CON_CCP5M0_SIZE                                0x1
#define _CCP5CON_CCP5M0_LENGTH                              0x1
#define _CCP5CON_CCP5M0_MASK                                0x1
#define _CCP5CON_CCP5M1_POSN                                0x1
#define _CCP5CON_CCP5M1_POSITION                            0x1
#define _CCP5CON_CCP5M1_SIZE                                0x1
#define _CCP5CON_CCP5M1_LENGTH                              0x1
#define _CCP5CON_CCP5M1_MASK                                0x2
#define _CCP5CON_CCP5M2_POSN                                0x2
#define _CCP5CON_CCP5M2_POSITION                            0x2
#define _CCP5CON_CCP5M2_SIZE                                0x1
#define _CCP5CON_CCP5M2_LENGTH                              0x1
#define _CCP5CON_CCP5M2_MASK                                0x4
#define _CCP5CON_CCP5M3_POSN                                0x3
#define _CCP5CON_CCP5M3_POSITION                            0x3
#define _CCP5CON_CCP5M3_SIZE                                0x1
#define _CCP5CON_CCP5M3_LENGTH                              0x1
#define _CCP5CON_CCP5M3_MASK                                0x8
#define _CCP5CON_DC5B0_POSN                                 0x4
#define _CCP5CON_DC5B0_POSITION                             0x4
#define _CCP5CON_DC5B0_SIZE                                 0x1
#define _CCP5CON_DC5B0_LENGTH                               0x1
#define _CCP5CON_DC5B0_MASK                                 0x10
#define _CCP5CON_DC5B1_POSN                                 0x5
#define _CCP5CON_DC5B1_POSITION                             0x5
#define _CCP5CON_DC5B1_SIZE                                 0x1
#define _CCP5CON_DC5B1_LENGTH                               0x1
#define _CCP5CON_DC5B1_MASK                                 0x20

// Register: CCPR5L
#define CCPR5L CCPR5L
extern volatile unsigned char           CCPR5L              __at(0xF10);
#ifndef _LIB_BUILD
asm("CCPR5L equ 0F10h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR5L                 :8;
    };
} CCPR5Lbits_t;
extern volatile CCPR5Lbits_t CCPR5Lbits __at(0xF10);
// bitfield macros
#define _CCPR5L_CCPR5L_POSN                                 0x0
#define _CCPR5L_CCPR5L_POSITION                             0x0
#define _CCPR5L_CCPR5L_SIZE                                 0x8
#define _CCPR5L_CCPR5L_LENGTH                               0x8
#define _CCPR5L_CCPR5L_MASK                                 0xFF

// Register: CCPR5H
#define CCPR5H CCPR5H
extern volatile unsigned char           CCPR5H              __at(0xF11);
#ifndef _LIB_BUILD
asm("CCPR5H equ 0F11h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR5H                 :8;
    };
} CCPR5Hbits_t;
extern volatile CCPR5Hbits_t CCPR5Hbits __at(0xF11);
// bitfield macros
#define _CCPR5H_CCPR5H_POSN                                 0x0
#define _CCPR5H_CCPR5H_POSITION                             0x0
#define _CCPR5H_CCPR5H_SIZE                                 0x8
#define _CCPR5H_CCPR5H_LENGTH                               0x8
#define _CCPR5H_CCPR5H_MASK                                 0xFF

// Register: CCP4CON
#define CCP4CON CCP4CON
extern volatile unsigned char           CCP4CON             __at(0xF12);
#ifndef _LIB_BUILD
asm("CCP4CON equ 0F12h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP4M                  :4;
        unsigned DC4B                   :2;
    };
    struct {
        unsigned CCP4M0                 :1;
        unsigned CCP4M1                 :1;
        unsigned CCP4M2                 :1;
        unsigned CCP4M3                 :1;
        unsigned DC4B0                  :1;
        unsigned DC4B1                  :1;
    };
} CCP4CONbits_t;
extern volatile CCP4CONbits_t CCP4CONbits __at(0xF12);
// bitfield macros
#define _CCP4CON_CCP4M_POSN                                 0x0
#define _CCP4CON_CCP4M_POSITION                             0x0
#define _CCP4CON_CCP4M_SIZE                                 0x4
#define _CCP4CON_CCP4M_LENGTH                               0x4
#define _CCP4CON_CCP4M_MASK                                 0xF
#define _CCP4CON_DC4B_POSN                                  0x4
#define _CCP4CON_DC4B_POSITION                              0x4
#define _CCP4CON_DC4B_SIZE                                  0x2
#define _CCP4CON_DC4B_LENGTH                                0x2
#define _CCP4CON_DC4B_MASK                                  0x30
#define _CCP4CON_CCP4M0_POSN                                0x0
#define _CCP4CON_CCP4M0_POSITION                            0x0
#define _CCP4CON_CCP4M0_SIZE                                0x1
#define _CCP4CON_CCP4M0_LENGTH                              0x1
#define _CCP4CON_CCP4M0_MASK                                0x1
#define _CCP4CON_CCP4M1_POSN                                0x1
#define _CCP4CON_CCP4M1_POSITION                            0x1
#define _CCP4CON_CCP4M1_SIZE                                0x1
#define _CCP4CON_CCP4M1_LENGTH                              0x1
#define _CCP4CON_CCP4M1_MASK                                0x2
#define _CCP4CON_CCP4M2_POSN                                0x2
#define _CCP4CON_CCP4M2_POSITION                            0x2
#define _CCP4CON_CCP4M2_SIZE                                0x1
#define _CCP4CON_CCP4M2_LENGTH                              0x1
#define _CCP4CON_CCP4M2_MASK                                0x4
#define _CCP4CON_CCP4M3_POSN                                0x3
#define _CCP4CON_CCP4M3_POSITION                            0x3
#define _CCP4CON_CCP4M3_SIZE                                0x1
#define _CCP4CON_CCP4M3_LENGTH                              0x1
#define _CCP4CON_CCP4M3_MASK                                0x8
#define _CCP4CON_DC4B0_POSN                                 0x4
#define _CCP4CON_DC4B0_POSITION                             0x4
#define _CCP4CON_DC4B0_SIZE                                 0x1
#define _CCP4CON_DC4B0_LENGTH                               0x1
#define _CCP4CON_DC4B0_MASK                                 0x10
#define _CCP4CON_DC4B1_POSN                                 0x5
#define _CCP4CON_DC4B1_POSITION                             0x5
#define _CCP4CON_DC4B1_SIZE                                 0x1
#define _CCP4CON_DC4B1_LENGTH                               0x1
#define _CCP4CON_DC4B1_MASK                                 0x20

// Register: CCPR4L
#define CCPR4L CCPR4L
extern volatile unsigned char           CCPR4L              __at(0xF13);
#ifndef _LIB_BUILD
asm("CCPR4L equ 0F13h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR4L                 :8;
    };
} CCPR4Lbits_t;
extern volatile CCPR4Lbits_t CCPR4Lbits __at(0xF13);
// bitfield macros
#define _CCPR4L_CCPR4L_POSN                                 0x0
#define _CCPR4L_CCPR4L_POSITION                             0x0
#define _CCPR4L_CCPR4L_SIZE                                 0x8
#define _CCPR4L_CCPR4L_LENGTH                               0x8
#define _CCPR4L_CCPR4L_MASK                                 0xFF

// Register: CCPR4H
#define CCPR4H CCPR4H
extern volatile unsigned char           CCPR4H              __at(0xF14);
#ifndef _LIB_BUILD
asm("CCPR4H equ 0F14h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR4H                 :8;
    };
} CCPR4Hbits_t;
extern volatile CCPR4Hbits_t CCPR4Hbits __at(0xF14);
// bitfield macros
#define _CCPR4H_CCPR4H_POSN                                 0x0
#define _CCPR4H_CCPR4H_POSITION                             0x0
#define _CCPR4H_CCPR4H_SIZE                                 0x8
#define _CCPR4H_CCPR4H_LENGTH                               0x8
#define _CCPR4H_CCPR4H_MASK                                 0xFF

