MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26J13/mcu.h
#define                                 P3DC1_bit           _BIT_ACCESS(ECCP3DEL,1)
// ECCP3DEL<P3DC2>
extern volatile __bit                   P3DC2               __at(0x78C2);	// @ (0xF18 * 8 + 2)
#define                                 P3DC2_bit           _BIT_ACCESS(ECCP3DEL,2)
// ECCP3DEL<P3DC3>
extern volatile __bit                   P3DC3               __at(0x78C3);	// @ (0xF18 * 8 + 3)
#define                                 P3DC3_bit           _BIT_ACCESS(ECCP3DEL,3)
// ECCP3DEL<P3DC4>
extern volatile __bit                   P3DC4               __at(0x78C4);	// @ (0xF18 * 8 + 4)
#define                                 P3DC4_bit           _BIT_ACCESS(ECCP3DEL,4)
// ECCP3DEL<P3DC5>
extern volatile __bit                   P3DC5               __at(0x78C5);	// @ (0xF18 * 8 + 5)
#define                                 P3DC5_bit           _BIT_ACCESS(ECCP3DEL,5)
// ECCP3DEL<P3DC6>
extern volatile __bit                   P3DC6               __at(0x78C6);	// @ (0xF18 * 8 + 6)
#define                                 P3DC6_bit           _BIT_ACCESS(ECCP3DEL,6)
// CCP3CON<P3M0>
extern volatile __bit                   P3M0                __at(0x78AE);	// @ (0xF15 * 8 + 6)
#define                                 P3M0_bit            _BIT_ACCESS(CCP3CON,6)
// CCP3CON<P3M1>
extern volatile __bit                   P3M1                __at(0x78AF);	// @ (0xF15 * 8 + 7)
#define                                 P3M1_bit            _BIT_ACCESS(CCP3CON,7)
// ECCP3DEL<P3RSEN>
extern volatile __bit                   P3RSEN              __at(0x78C7);	// @ (0xF18 * 8 + 7)
#define                                 P3RSEN_bit          _BIT_ACCESS(ECCP3DEL,7)
// PORTC<PA1>
extern volatile __bit                   PA1                 __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 PA1_bit             _BIT_ACCESS(PORTC,2)
// PORTC<PA2>
extern volatile __bit                   PA2                 __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 PA2_bit             _BIT_ACCESS(PORTC,1)
// ANCON0<PCFG0>
extern volatile __bit                   PCFG0               __at(0x7A40);	// @ (0xF48 * 8 + 0)
#define                                 PCFG0_bit           _BIT_ACCESS(ANCON0,0)
// ANCON0<PCFG1>
extern volatile __bit                   PCFG1               __at(0x7A41);	// @ (0xF48 * 8 + 1)
#define                                 PCFG1_bit           _BIT_ACCESS(ANCON0,1)
// ANCON1<PCFG10>
extern volatile __bit                   PCFG10              __at(0x7A4A);	// @ (0xF49 * 8 + 2)
#define                                 PCFG10_bit          _BIT_ACCESS(ANCON1,2)
// ANCON1<PCFG11>
extern volatile __bit                   PCFG11              __at(0x7A4B);	// @ (0xF49 * 8 + 3)
#define                                 PCFG11_bit          _BIT_ACCESS(ANCON1,3)
// ANCON1<PCFG12>
extern volatile __bit                   PCFG12              __at(0x7A4C);	// @ (0xF49 * 8 + 4)
#define                                 PCFG12_bit          _BIT_ACCESS(ANCON1,4)
// ANCON1<PCFG15>
extern volatile __bit                   PCFG15              __at(0x7A4F);	// @ (0xF49 * 8 + 7)
#define                                 PCFG15_bit          _BIT_ACCESS(ANCON1,7)
// ANCON0<PCFG2>
extern volatile __bit                   PCFG2               __at(0x7A42);	// @ (0xF48 * 8 + 2)
#define                                 PCFG2_bit           _BIT_ACCESS(ANCON0,2)
// ANCON0<PCFG3>
extern volatile __bit                   PCFG3               __at(0x7A43);	// @ (0xF48 * 8 + 3)
#define                                 PCFG3_bit           _BIT_ACCESS(ANCON0,3)
// ANCON0<PCFG4>
extern volatile __bit                   PCFG4               __at(0x7A44);	// @ (0xF48 * 8 + 4)
#define                                 PCFG4_bit           _BIT_ACCESS(ANCON0,4)
// ANCON1<PCFG8>
extern volatile __bit                   PCFG8               __at(0x7A48);	// @ (0xF49 * 8 + 0)
#define                                 PCFG8_bit           _BIT_ACCESS(ANCON1,0)
// ANCON1<PCFG9>
extern volatile __bit                   PCFG9               __at(0x7A49);	// @ (0xF49 * 8 + 1)
#define                                 PCFG9_bit           _BIT_ACCESS(ANCON1,1)
// RCON<PD>
extern volatile __bit                   PD                  __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 PD_bit              _BIT_ACCESS(RCON,2)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// INTCON<PEIE_GIEL>
extern volatile __bit                   PEIE_GIEL           __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 PEIE_GIEL_bit       _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN1>
extern volatile __bit                   PEN1                __at(0x7E2A);	// @ (0xFC5 * 8 + 2)
#define                                 PEN1_bit            _BIT_ACCESS(SSP1CON2,2)
// SSP2CON2<PEN2>
extern volatile __bit                   PEN2                __at(0x7B8A);	// @ (0xF71 * 8 + 2)
#define                                 PEN2_bit            _BIT_ACCESS(SSP2CON2,2)
// PORTB<PGC>
extern volatile __bit                   PGC                 __at(0x7C0E);	// @ (0xF81 * 8 + 6)
#define                                 PGC_bit             _BIT_ACCESS(PORTB,6)
// PORTB<PGD>
extern volatile __bit                   PGD                 __at(0x7C0F);	// @ (0xF81 * 8 + 7)
#define                                 PGD_bit             _BIT_ACCESS(PORTB,7)
// OSCTUNE<PLLEN>
extern volatile __bit                   PLLEN               __at(0x7CDE);	// @ (0xF9B * 8 + 6)
#define                                 PLLEN_bit           _BIT_ACCESS(OSCTUNE,6)
// PMDIS0<PMDADC>
extern volatile __bit                   PMDADC              __at(0x75C8);	// @ (0xEB9 * 8 + 0)
#define                                 PMDADC_bit          _BIT_ACCESS(PMDIS0,0)
// PMDIS3<PMDCCP10>
extern volatile __bit                   PMDCCP10            __at(0x75E7);	// @ (0xEBC * 8 + 7)
#define                                 PMDCCP10_bit        _BIT_ACCESS(PMDIS3,7)
// PMDIS3<PMDCCP4>
extern volatile __bit                   PMDCCP4             __at(0x75E1);	// @ (0xEBC * 8 + 1)
#define                                 PMDCCP4_bit         _BIT_ACCESS(PMDIS3,1)
// PMDIS3<PMDCCP5>
extern volatile __bit                   PMDCCP5             __at(0x75E2);	// @ (0xEBC * 8 + 2)
#define                                 PMDCCP5_bit         _BIT_ACCESS(PMDIS3,2)
// PMDIS3<PMDCCP6>
extern volatile __bit                   PMDCCP6             __at(0x75E3);	// @ (0xEBC * 8 + 3)
#define                                 PMDCCP6_bit         _BIT_ACCESS(PMDIS3,3)
// PMDIS3<PMDCCP7>
extern volatile __bit                   PMDCCP7             __at(0x75E4);	// @ (0xEBC * 8 + 4)
#define                                 PMDCCP7_bit         _BIT_ACCESS(PMDIS3,4)
// PMDIS3<PMDCCP8>
extern volatile __bit                   PMDCCP8             __at(0x75E5);	// @ (0xEBC * 8 + 5)
#define                                 PMDCCP8_bit         _BIT_ACCESS(PMDIS3,5)
// PMDIS3<PMDCCP9>
extern volatile __bit                   PMDCCP9             __at(0x75E6);	// @ (0xEBC * 8 + 6)
#define                                 PMDCCP9_bit         _BIT_ACCESS(PMDIS3,6)
// PMDIS2<PMDCMP1>
extern volatile __bit                   PMDCMP1             __at(0x75D8);	// @ (0xEBB * 8 + 0)
#define                                 PMDCMP1_bit         _BIT_ACCESS(PMDIS2,0)
// PMDIS2<PMDCMP2>
extern volatile __bit                   PMDCMP2             __at(0x75D9);	// @ (0xEBB * 8 + 1)
#define                                 PMDCMP2_bit         _BIT_ACCESS(PMDIS2,1)
// PMDIS2<PMDCMP3>
extern volatile __bit                   PMDCMP3             __at(0x75DA);	// @ (0xEBB * 8 + 2)
#define                                 PMDCMP3_bit         _BIT_ACCESS(PMDIS2,2)
// PMDIS1<PMDCTMU>
extern volatile __bit                   PMDCTMU             __at(0x75D6);	// @ (0xEBA * 8 + 6)
#define                                 PMDCTMU_bit         _BIT_ACCESS(PMDIS1,6)
// PMDIS0<PMDECCP1>
extern volatile __bit                   PMDECCP1            __at(0x75CD);	// @ (0xEB9 * 8 + 5)
#define                                 PMDECCP1_bit        _BIT_ACCESS(PMDIS0,5)
// PMDIS0<PMDECCP2>
extern volatile __bit                   PMDECCP2            __at(0x75CE);	// @ (0xEB9 * 8 + 6)
#define                                 PMDECCP2_bit        _BIT_ACCESS(PMDIS0,6)
// PMDIS0<PMDECCP3>
extern volatile __bit                   PMDECCP3            __at(0x75CF);	// @ (0xEB9 * 8 + 7)
#define                                 PMDECCP3_bit        _BIT_ACCESS(PMDIS0,7)
// PMDIS0<PMDMSSP1>
extern volatile __bit                   PMDMSSP1            __at(0x75C9);	// @ (0xEB9 * 8 + 1)
#define                                 PMDMSSP1_bit        _BIT_ACCESS(PMDIS0,1)
// PMDIS0<PMDMSSP2>
extern volatile __bit                   PMDMSSP2            __at(0x75CA);	// @ (0xEB9 * 8 + 2)
#define                                 PMDMSSP2_bit        _BIT_ACCESS(PMDIS0,2)
// PMDIS1<PMDRTCC>
extern volatile __bit                   PMDRTCC             __at(0x75D5);	// @ (0xEBA * 8 + 5)
#define                                 PMDRTCC_bit         _BIT_ACCESS(PMDIS1,5)
// PMDIS1<PMDTMR1>
extern volatile __bit                   PMDTMR1             __at(0x75D1);	// @ (0xEBA * 8 + 1)
#define                                 PMDTMR1_bit         _BIT_ACCESS(PMDIS1,1)
// PMDIS1<PMDTMR2>
extern volatile __bit                   PMDTMR2             __at(0x75D2);	// @ (0xEBA * 8 + 2)
#define                                 PMDTMR2_bit         _BIT_ACCESS(PMDIS1,2)
// PMDIS1<PMDTMR3>
extern volatile __bit                   PMDTMR3             __at(0x75D3);	// @ (0xEBA * 8 + 3)
#define                                 PMDTMR3_bit         _BIT_ACCESS(PMDIS1,3)
// PMDIS1<PMDTMR4>
extern volatile __bit                   PMDTMR4             __at(0x75D4);	// @ (0xEBA * 8 + 4)
#define                                 PMDTMR4_bit         _BIT_ACCESS(PMDIS1,4)
// PMDIS2<PMDTMR5>
extern volatile __bit                   PMDTMR5             __at(0x75DB);	// @ (0xEBB * 8 + 3)
#define                                 PMDTMR5_bit         _BIT_ACCESS(PMDIS2,3)
// PMDIS2<PMDTMR6>
extern volatile __bit                   PMDTMR6             __at(0x75DC);	// @ (0xEBB * 8 + 4)
#define                                 PMDTMR6_bit         _BIT_ACCESS(PMDIS2,4)
// PMDIS2<PMDTMR8>
extern volatile __bit                   PMDTMR8             __at(0x75DE);	// @ (0xEBB * 8 + 6)
#define                                 PMDTMR8_bit         _BIT_ACCESS(PMDIS2,6)
// PMDIS0<PMDUART1>
extern volatile __bit                   PMDUART1            __at(0x75CB);	// @ (0xEB9 * 8 + 3)
#define                                 PMDUART1_bit        _BIT_ACCESS(PMDIS0,3)
// PMDIS0<PMDUART2>
extern volatile __bit                   PMDUART2            __at(0x75CC);	// @ (0xEB9 * 8 + 4)
#define                                 PMDUART2_bit        _BIT_ACCESS(PMDIS0,4)
// RCON<POR>
extern volatile __bit                   POR                 __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 POR_bit             _BIT_ACCESS(RCON,1)
// OSCCON2<PRISD>
extern volatile __bit                   PRISD               __at(0x7C3A);	// @ (0xF87 * 8 + 2)
#define                                 PRISD_bit           _BIT_ACCESS(OSCCON2,2)
// T0CON<PSA>
extern volatile __bit                   PSA                 __at(0x7EAB);	// @ (0xFD5 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(T0CON,3)
// ECCP1AS<PSS1AC0>
extern volatile __bit                   PSS1AC0             __at(0x7DF2);	// @ (0xFBE * 8 + 2)
#define                                 PSS1AC0_bit         _BIT_ACCESS(ECCP1AS,2)
// ECCP1AS<PSS1AC1>
extern volatile __bit                   PSS1AC1             __at(0x7DF3);	// @ (0xFBE * 8 + 3)
#define                                 PSS1AC1_bit         _BIT_ACCESS(ECCP1AS,3)
// ECCP1AS<PSS1BD0>
extern volatile __bit                   PSS1BD0             __at(0x7DF0);	// @ (0xFBE * 8 + 0)
#define                                 PSS1BD0_bit         _BIT_ACCESS(ECCP1AS,0)
// ECCP1AS<PSS1BD1>
extern volatile __bit                   PSS1BD1             __at(0x7DF1);	// @ (0xFBE * 8 + 1)
#define                                 PSS1BD1_bit         _BIT_ACCESS(ECCP1AS,1)
// ECCP2AS<PSS2AC0>
extern volatile __bit                   PSS2AC0             __at(0x7DC2);	// @ (0xFB8 * 8 + 2)
#define                                 PSS2AC0_bit         _BIT_ACCESS(ECCP2AS,2)
// ECCP2AS<PSS2AC1>
extern volatile __bit                   PSS2AC1             __at(0x7DC3);	// @ (0xFB8 * 8 + 3)
#define                                 PSS2AC1_bit         _BIT_ACCESS(ECCP2AS,3)
// ECCP2AS<PSS2BD0>
extern volatile __bit                   PSS2BD0             __at(0x7DC0);	// @ (0xFB8 * 8 + 0)
#define                                 PSS2BD0_bit         _BIT_ACCESS(ECCP2AS,0)
// ECCP2AS<PSS2BD1>
extern volatile __bit                   PSS2BD1             __at(0x7DC1);	// @ (0xFB8 * 8 + 1)
#define                                 PSS2BD1_bit         _BIT_ACCESS(ECCP2AS,1)
// ECCP3AS<PSS3AC0>
extern volatile __bit                   PSS3AC0             __at(0x78CA);	// @ (0xF19 * 8 + 2)
#define                                 PSS3AC0_bit         _BIT_ACCESS(ECCP3AS,2)
// ECCP3AS<PSS3AC1>
extern volatile __bit                   PSS3AC1             __at(0x78CB);	// @ (0xF19 * 8 + 3)
#define                                 PSS3AC1_bit         _BIT_ACCESS(ECCP3AS,3)
// ECCP3AS<PSS3BD0>
extern volatile __bit                   PSS3BD0             __at(0x78C8);	// @ (0xF19 * 8 + 0)
#define                                 PSS3BD0_bit         _BIT_ACCESS(ECCP3AS,0)
// ECCP3AS<PSS3BD1>
extern volatile __bit                   PSS3BD1             __at(0x78C9);	// @ (0xF19 * 8 + 1)
#define                                 PSS3BD1_bit         _BIT_ACCESS(ECCP3AS,1)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTA<RA6>
extern volatile __bit                   RA6                 __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// PORTA<RA7>
extern volatile __bit                   RA7                 __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 RA7_bit             _BIT_ACCESS(PORTA,7)
// PORTB<RB0>
extern volatile __bit                   RB0                 __at(0x7C08);	// @ (0xF81 * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// PORTB<RB1>
extern volatile __bit                   RB1                 __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 RB1_bit             _BIT_ACCESS(PORTB,1)
// PORTB<RB2>
extern volatile __bit                   RB2                 __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RB3>
extern volatile __bit                   RB3                 __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 RB3_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x7C0C);	// @ (0xF81 * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x7C0D);	// @ (0xF81 * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x7C0E);	// @ (0xF81 * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x7C0F);	// @ (0xF81 * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// INTCON<RBIE>
extern volatile __bit                   RBIE                __at(0x7F93);	// @ (0xFF2 * 8 + 3)
#define                                 RBIE_bit            _BIT_ACCESS(INTCON,3)
// INTCON<RBIF>
extern volatile __bit                   RBIF                __at(0x7F90);	// @ (0xFF2 * 8 + 0)
#define                                 RBIF_bit            _BIT_ACCESS(INTCON,0)
// INTCON2<RBIP>
extern volatile __bit                   RBIP                __at(0x7F88);	// @ (0xFF1 * 8 + 0)
#define                                 RBIP_bit            _BIT_ACCESS(INTCON2,0)
// INTCON2<RBPU>
extern volatile __bit                   RBPU                __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 RBPU_bit            _BIT_ACCESS(INTCON2,7)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x7C10);	// @ (0xF82 * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PIE1<RC1IE>
extern volatile __bit                   RC1IE               __at(0x7CED);	// @ (0xF9D * 8 + 5)
#define                                 RC1IE_bit           _BIT_ACCESS(PIE1,5)
// PIR1<RC1IF>
extern volatile __bit                   RC1IF               __at(0x7CF5);	// @ (0xF9E * 8 + 5)
#define                                 RC1IF_bit           _BIT_ACCESS(PIR1,5)
// IPR1<RC1IP>
extern volatile __bit                   RC1IP               __at(0x7CFD);	// @ (0xF9F * 8 + 5)
#define                                 RC1IP_bit           _BIT_ACCESS(IPR1,5)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PIE3<RC2IE>
extern volatile __bit                   RC2IE               __at(0x7D1D);	// @ (0xFA3 * 8 + 5)
#define                                 RC2IE_bit           _BIT_ACCESS(PIE3,5)
// PIR3<RC2IF>
extern volatile __bit                   RC2IF               __at(0x7D25);	// @ (0xFA4 * 8 + 5)
#define                                 RC2IF_bit           _BIT_ACCESS(PIR3,5)
// IPR3<RC2IP>
extern volatile __bit                   RC2IP               __at(0x7D2D);	// @ (0xFA5 * 8 + 5)
#define                                 RC2IP_bit           _BIT_ACCESS(IPR3,5)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x7C15);	// @ (0xF82 * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// RCSTA1<RC8_9>
extern volatile __bit                   RC8_9               __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 RC8_9_bit           _BIT_ACCESS(RCSTA1,6)
// RCSTA2<RC8_92>
extern volatile __bit                   RC8_92              __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 RC8_92_bit          _BIT_ACCESS(RCSTA2,6)
// RCSTA1<RC9>
extern volatile __bit                   RC9                 __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 RC9_bit             _BIT_ACCESS(RCSTA1,6)
// RCSTA2<RC92>
extern volatile __bit                   RC92                __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 RC92_bit            _BIT_ACCESS(RCSTA2,6)
// RCSTA1<RCD8>
extern volatile __bit                   RCD8                __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 RCD8_bit            _BIT_ACCESS(RCSTA1,0)
// RCSTA2<RCD82>
extern volatile __bit                   RCD82               __at(0x7CE0);	// @ (0xF9C * 8 + 0)
#define                                 RCD82_bit           _BIT_ACCESS(RCSTA2,0)
// SSP1CON2<RCEN1>
extern volatile __bit                   RCEN1               __at(0x7E2B);	// @ (0xFC5 * 8 + 3)
#define                                 RCEN1_bit           _BIT_ACCESS(SSP1CON2,3)
// SSP2CON2<RCEN2>
extern volatile __bit                   RCEN2               __at(0x7B8B);	// @ (0xF71 * 8 + 3)
#define                                 RCEN2_bit           _BIT_ACCESS(SSP2CON2,3)
// BAUDCON1<RCIDL1>
extern volatile __bit                   RCIDL1              __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 RCIDL1_bit          _BIT_ACCESS(BAUDCON1,6)
// BAUDCON2<RCIDL2>
extern volatile __bit                   RCIDL2              __at(0x7BE6);	// @ (0xF7C * 8 + 6)
#define                                 RCIDL2_bit          _BIT_ACCESS(BAUDCON2,6)
// PIE1<RCIE>
extern volatile __bit                   RCIE                __at(0x7CED);	// @ (0xF9D * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<RCIF>
extern volatile __bit                   RCIF                __at(0x7CF5);	// @ (0xF9E * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR1,5)
// IPR1<RCIP>
extern volatile __bit                   RCIP                __at(0x7CFD);	// @ (0xF9F * 8 + 5)
#define                                 RCIP_bit            _BIT_ACCESS(IPR1,5)
// BAUDCON1<RCMT>
extern volatile __bit                   RCMT                __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 RCMT_bit            _BIT_ACCESS(BAUDCON1,6)
// BAUDCON1<RCMT1>
extern volatile __bit                   RCMT1               __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 RCMT1_bit           _BIT_ACCESS(BAUDCON1,6)
// BAUDCON2<RCMT2>
extern volatile __bit                   RCMT2               __at(0x7BE6);	// @ (0xF7C * 8 + 6)
#define                                 RCMT2_bit           _BIT_ACCESS(BAUDCON2,6)
// T3CON<RD163>
extern volatile __bit                   RD163               __at(0x7BCF);	// @ (0xF79 * 8 + 7)
#define                                 RD163_bit           _BIT_ACCESS(T3CON,7)
// T5CON<RD165>
extern volatile __bit                   RD165               __at(0x7911);	// @ (0xF22 * 8 + 1)
#define                                 RD165_bit           _BIT_ACCESS(T5CON,1)
// SSP1STAT<READ_WRITE>
extern volatile __bit                   READ_WRITE          __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 READ_WRITE_bit      _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<READ_WRITE2>
